# Витя работает недалеко от одной из станций кольцевой линии Московского метро,
# а живет рядом с другой станцией той же линии. Требуется выяснить,мимо какого
# наименьшего количества промежуточных станций необходимо проехать Вите по кольцу,
# чтобы добраться с работы домой.

# Станции пронумерованы подряд натуральными числами 1, 2, 3, …, N (1-я станция – соседняя с N-й),
# N не превосходит 100.
# Вводятся три числа: сначала N – общее количество станций кольцевой линии,
# а затем i и j – номера станции, на которой Витя садится, и станции, на которой он должен выйти.
# Числа i и j не совпадают. Все числа разделены пробелом.

n, i, j = map(int, input().split())
# движение по часовой стрелки, начальная и конечная станции не совпадают - поэтому расст не будет равно 0.
dist1 = abs(j - i) - 1
# против часовой стрелки
dist2 = n - 2 - dist1
print(min(dist1, dist2))

# N, i, j = map(int, input().split())
# p = 0
# p = abs(i-j)
# if p <= N // 2:
#     p -= 1
# else:
#     p = N - p - 1
# print(p)