# Напишите программу, которая определяет взаимное расположение точки X
# и треугольника. Если точка X расположена внутри или на сторонах треугольника,
# выведите 0. Если же точка находится вне треугольника,
# выведите номер ближайшей к ней вершины.

d = int(input())
x, y = map(int, input().split())
# точка внутри треугольника, то выведем 0
if x >= 0 and y >= 0 and x + y <= d:
    print(0)
else:
    # расстояние от точки (0, 0) до нашей точки (x, y) и номер вершины
    dist = [(x ** 2 + y ** 2, 1), ((x - d) ** 2 + y ** 2, 2), (x ** 2 + (y - d) ** 2, 3)]
    # выбираем мин элемент и печатаем номер вершины из кортежа
    # если расстояние будет совпадать, то сравниваем номер вершины и выбираем минимальный
    print(min(dist)[1])

# d = int(input())
# x, y = map(int, input().split())
# k = 0
# if (x >= 0) and (y >= 0) and (x + y <= d):
#     print(0)
# elif (y <= x) and (y > d - x):
#     print(2)
# elif (y > x):
#     print(3)
# elif (y <= 0.5):
#     print(1)
# elif (y > 0.5):
#     print(3)
# elif (x <= 0.5):
#     print(1)
# elif (x > 0.5):
#     print(2)