# Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n.
# Беатриса пытается угадать это число, для этого она называет некоторые множества натуральных чисел.
# Август отвечает Беатрисе YES, если среди названных ей чисел есть задуманное или NO в противном случае.
# После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы она задавала
# и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.

# Первая строка входных данных содержит число n — наибольшее число, которое мог загадать Август.
# Далее идут строки, содержащие вопросы Беатрисы. Каждая строка представляет собой набор чисел,
# разделенных пробелами. После каждой строки с вопросом идет ответ Августа: YES или NO.
# Наконец, последняя строка входных данных содержит одно слово HELP.

# Вы должны вывести (через пробел, в порядке возрастания) все числа, которые мог задумать Август.
# считываем первую строку
n = int(input())
possible_nums = set(range(1, n + 1))
# считываем вторую строку: первый набор чисел, если он есть
s = input().strip()
while s != 'HELP':
    # считываем наш первый набор чисел и преобразуем во множество
    nums = set(map(int, s.split()))
    # считываем строку с ответом считываем ответ YES или NO
    s = input().strip()
    # если ответ YES, то
    if s == 'YES':
        # обновляем наше множество, теперь это пересечение с множеством на которое был ответ YES
        possible_nums.intersection_update(nums)
    else:
        possible_nums.difference_update(nums)
    # считываем следующий набор чисел в цикле, апдейтим s - переходим на новую строку
    s = input().strip()
# * - печать через пробел
print(*sorted(possible_nums))