# Последовательность состоит из натуральных чисел и завершается числом 0.
# Всего вводится не более 10000 чисел (не считая завершающего числа 0).
# Определите, сколько элементов этой последовательности равны ее наибольшему элементу.
# Числа, следующие за числом 0, считывать не нужно.

s = -1
smax = 0
snum = 0
while s != 0:
    s = int(input())
    if s > smax:
        smax = s
        snum = 1
    elif s == smax:
        snum += 1
print(snum)