# В строкоремонтную мастерскую принесли строку, состоящую из строчных латинских букв.
# Заказчик хочет сделать из неё палиндром. В мастерской могут за 1 байтландский тугрик
# заменить произвольную букву в строке любой выбранной заказчиком буквой.
# Какую минимальную сумму придётся заплатить заказчику за ремонт строки?


seq = input()
def palidrom(seq):
    lent = int(len(seq)) // 2
    result = 0
    for i in range(lent):
        if seq[i] != seq[len(seq) - 1 - i]:
            result += 1
    return result

ans = palidrom(seq)

print(ans)

