# дана строка. Найти самый встречающийся символ, если таких несколько, то вывести любой.
# медленное решение, двойной цикл
# s = input()
# ans = ''
# anscnt = 0
# for i in range(len(s)): # первый цикл проходимся по строки фиксируем символ
#     nowcnt = 0    # считаем сколько раз встретился символ
#     for j in range(len(s)):  # и проходя вторым циклом сравниваем каждый символ с фиксированным
#         if s[i] == s[j]:
#             nowcnt += 1
#     if nowcnt > anscnt: # выбираем макс частоту по каждому символу в строке
#         ans = s[i]  # перезаписываем в ans самый частый символ
#         anscnt = nowcnt # перезаписвыем как часто встречается
# print(ans)

# один цикл - линейный поиск

# s = input()
# ans = ''   # символ
# anscnt = 0 # частота символов
#
# for now in set(s): # множество значений символов из строки
#     nowcnt = 0
#     for j in range(len(s)): # проходимся по строке
#         if now == s[j]:   # сравниваем каждое значение с символов из множества
#             nowcnt += 1   # увеличиваем счетчик если значения совпадают
#     if nowcnt > anscnt:
#         ans = now
#         anscnt = nowcnt
# print(ans)


# словарь и нахождение максимума
s = input()
dct = {}
anscnt = 0
for now in s: # пройдемся по строке, каждый символ = now
    if now not in dct: # если символ еще не в словаре
        dct[now] = 0 # создаем элемент now и присваем ему значение 0
    dct[now] += 1  # увеличиваем счетчик
for key in dct: # переберем все ключи
    if dct[key] > anscnt: #
        anscnt = dct[key]
        ans = key
print(ans)