# Дана последовательность чисел. Требуется определить какое мин количество и каких чисел надо приписать, чтобы
# чтобы последовательность стала симметричной.

seq = list(map(int, input().split()))

def slow(seq):
    for start in range(len(seq)):
        i = start # два указателя
        j = len(seq) - 1
    # последний элемент последовательности
    # идем с начала строки указателем i и с конца строки указателем j
    # если символы с начала строки и с конца строки совпадают
    # и пока левый указатель не больше правого увеличиваем указатели
        while i < len(seq) and j >= 0 and seq[i] == seq[j] and i <= j:
            i += 1
            j -= 1
        if i > j: # если первый указатель больше второго
            ans = []
            for i in range(start - 1, -1, -1):
                ans.append(seq[i])
            return ans
ans = slow(seq)
print(len(ans))
print(ans)
